---
kind: other
id: Methods.T:Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry
source: html/529f5713-89bb-661c-6e99-33eebdb7f8d4.htm
---
# PointCloudEngineRegistry Methods

Returns a list of the identifiers supported by point cloud engines registered to Revit.